
import 'package:zakate/core/constant/images.dart';
import 'package:zakate/data/model/zakatModel.dart';

List<ZakatModel> listzakat=[
  ZakatModel(
      tite: 'ما مَعنَى الزكاة؟',
      image: AppImages.zakatone,
      body:
      '''الزكاة في اللغة معناها: النَمَاء\n وتأتي أيضاً بمعنى: التطهير، قال تعالى: (قَدْ أَفْلَحَ مَن زَكَّاهَا) [2]، وقد سُمِّيَت الزكاة بذلك الاسم لأنَّ في إخراجها نماءٌ للمال، ويَكْثُرُ بسببها الأجر، ولأنها تُطَهِر النفس من رذيلة البُخل، وأما معناها في الشرع فهو : نصيبٌ مُقدَّرٌ شرعاً، في مالٍ مُعَيَّن، يُصرَفُ لطائفةٍ مخصوصة واعلم أنه
            قد ثبتت فرضِيّة الزكاة بالكتاب والسُنَّة والإجماع \n قال تعالى: ﴿ خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عليهمْ إِنَّ صَلاتَكَ سَكَنٌ لَّهُمْ ﴾ [3] ''',
  ),



  ZakatModel(
      tite: 'مَن يستفيد من الزكاة؟',
      image: AppImages.zakattwo,
      body: '''ذكرت الآية الكريمة عدة مجموعات أساسية تستفيد من الزكاة، فقال الله عز وجل: “إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَاِبْنِ السَّبِيلِ فَرِيضَةً مِنَ اللَّهِ وَاللَّهُ عَلِيمٌ حَكِيمٌ” – سورة التوبة (60).
      وهذا يعني أن الزكاة تُصرف للمجموعات التالية:
      الفقراء والمساكين.
      العاملون على إدارة أموال الزكاة وإيصالها إلى المحتاجين.
      المسلمون الجدد لتأليف قلوبهم وتثبيتهم.
      الأسرى والغارمون.
      في سبيل الله.
      ابن السبيل والذين يُعتبرون اليوم من اللاجئين والنازحين والفقراء بلا مأوى أو مسكن.
      الأقرباء من الفقراء والمحتاجين.'''
  ),
  ZakatModel(
      tite: 'ما حُكْم مانِع الزكاة؟',
      image: AppImages.zakatthree,
      body: '''
الزكاة مِن فرائض الإسلام وأركانه، ويجب إخراجها على الفور ما أمْكَنَه، وقد أجمعت الأمة على أنَّ تَرْك الزكاة من الكبائر، فإنْ تَرَكَهَا جاحداً لفرضيتها - بعد أنْ عَلِمَ بوجوبها - فهو كافر، خارج عن الإسلام، ويجب على وَلِيّ الأمر قتله لِكُفره، فإنْ كانَ قريبَ عهدٍ بالإسلام، أو نشأ في بادِيَة بعيدة، فيُعْذَرُ حينئذٍ لِجَهْلِه، لكنه إنْ كانَ بين ديار المسلمين، ثم ادَّعَى الجهل فلا يُعْذَرُ لِجَهْلِه، لأنَّ فرضية الزكاة من الأشياء المعلومة من الدين بالضرورة
'''
  ),
  ZakatModel(
      tite: 'ما هي أنواع الزكاة؟',
      image: AppImages.zakatfour,
      body: '''أنواع الزكاة هي: (زكاة الحُلِيّ - زكاة الأوراق البَنكية والسَنَدَات - زكاة الفِطر - زكاة عُرُوض التجارة - زكاة الرِّكَاز(وهو كل شيءٍ له قيمة، قد دُفِنَ في الأرض مِن أيام الجاهلية كما سيأتي) - زكاة الأنعام - زكاة الزروع).
'''
  ),
  ZakatModel(
      tite: 'المِقدار الواجب للزكاة؟',
      image: AppImages.zakatfive,
      body: '''ما هو المِقدار الواجب إخراجه في زكاة الفِطر؟ \nالواجب في زكاة الفِطر: " صاع " مِن أقوات البلد، فعلى هذا يُخرِج صاعاً من شعير، أو صاعاً من زبيب، أو صاعاً من تَمر، أو أي شئ آخر مما يُعَدّ قوتاً أساسياً للبلد كالأرز والقمح والذرة ونحو ذلك.
'''
  ),
  ZakatModel(
    tite: ':وتقدير الصاع',
    image: AppImages.zakatsix,
    body: ''' أربع حِفنات بِكَفَّي الرجل المعتدل، (والصاع هو عبارة عن مِكيال معين يُكَالُ به الحبوب، وتختلف قيمته بالكيلو جرام لكل نوع من أنواع الحبوب، وذلك حسب وزن كل نوع (فمثلاً: وزن الأرز الذي يملأ هذا المِكيال غير وزن المكرونة التي تملؤه، فالمكرونه خفيفة في الوزن، وهكذا سائر الحبوب تتفاوت في الوزن) (والخُلاصَة أنه يمكننا أن نقول: كم عدد الكيلو جرامات - من الحبوب - التي تملأ هذا الصاع؟)(كم (كيلو) من الأرز يملأ هذا الصاع؟، وكم (كيلو) من التمر يملؤه؟ وهكذا)، وقد سَجَّلَ بعض الدُعاة مقادير زكاة بعض هذه الأصناف بالكيلو جرام كالآتي:(صاع الأرزيُملأ بـ:(3. 2 كجم) أرز)، (صاع التمر: 3 كجم تمر)، (صاع اللُوبيا: 2كجم لوبيا)، (صاع الزبيب: 6. 1 كجم زبيب)، (صاع الفاصُولْيَا: 65. 2 كجم فاصوليا)، (صاع العَدْس بجِبَّة: 3 كجم عدس بجبة)، (صاع العَدْس الأصفر: 2 كجم عدس أصفر).
'''
  )
];